app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("title", "ingredients", "instructions", "vegetarian", "image", "cook_time", "prep_time", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def create
      recipe = Recipe.create(recipe_params)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "recipes" SET "title" = $1, "updated_at" = $2, "user_id" = $3 WHERE "recipes"."id" = $4  [["title", "Veggie Barlic Noodles"], ["updated_at", "2023-05-20 17:48:11.688608"], ["user_id", 5], ["id", 1]]
---
    def update
      recipe = Recipe.find(params[:id])
      recipe.update(recipe_params)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 3]]
---
    def destroy
        recipe = Recipe.find(params[:id])
        if recipe.destroy